RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_syscfg.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
#define NOT_SYSCFG_I2C_FMP(xxx)             (((xxx) != SYSCFG_I2C0_FMP)    && ((xxx) != SYSCFG_I2C1_FMP) && \
                                            ((xxx) != SYSCFG_I2C2_FMP)    && ((xxx) != SYSCFG_I2C3_FMP) && \
                                            ((xxx) != SYSCFG_I2C_FMP_PB6) && ((xxx) != SYSCFG_I2C_FMP_PB7) && \
                                            ((xxx) != SYSCFG_I2C_FMP_PB8) && ((xxx) != SYSCFG_I2C_FMP_PB9))
                                              
#define NOT_SYSCFG_ANALOG_SWITCH(xxx)       (((xxx) != SYSCFG_PA0_ANALOG_SWITCH) && ((xxx) != SYSCFG_PA1_ANALOG_SWITCH) && \
                                            ((xxx) != SYSCFG_PC2_ANALOG_SWITCH) && ((xxx) != SYSCFG_PC3_ANALOG_SWITCH))
                                              

#define NOT_EXTI_SOURCE_GPIO(xxx)           (((xxx) != EXTI_SOURCE_GPIOA) && ((xxx) != EXTI_SOURCE_GPIOB) && \
                                            ((xxx) != EXTI_SOURCE_GPIOC) && ((xxx) != EXTI_SOURCE_GPIOD) && \
                                            ((xxx) != EXTI_SOURCE_GPIOE) && ((xxx) != EXTI_SOURCE_GPIOF) && \
                                            ((xxx) != EXTI_SOURCE_GPIOG) && ((xxx) != EXTI_SOURCE_GPIOH) && \
                                            ((xxx) != EXTI_SOURCE_GPIOJ) && ((xxx) != EXTI_SOURCE_GPIOK))

#define NOT_EXTI_SOURCE_PIN(xxx)            (((xxx) != EXTI_SOURCE_PIN0)  && ((xxx) != EXTI_SOURCE_PIN1) && \
                                            ((xxx) != EXTI_SOURCE_PIN2)  && ((xxx) != EXTI_SOURCE_PIN3) && \
                                            ((xxx) != EXTI_SOURCE_PIN4)  && ((xxx) != EXTI_SOURCE_PIN5) && \
                                            ((xxx) != EXTI_SOURCE_PIN6)  && ((xxx) != EXTI_SOURCE_PIN7) && \
                                            ((xxx) != EXTI_SOURCE_PIN8)  && ((xxx) != EXTI_SOURCE_PIN9) && \
                                            ((xxx) != EXTI_SOURCE_PIN10) && ((xxx) != EXTI_SOURCE_PIN11) && \
                                            ((xxx) != EXTI_SOURCE_PIN12) && ((xxx) != EXTI_SOURCE_PIN13) && \
                                            ((xxx) != EXTI_SOURCE_PIN14) && ((xxx) != EXTI_SOURCE_PIN15))

#define NOT_SYSCFG_LOCKUP(xxx)              (((xxx) != SYSCFG_LVD_LOCKUP)    && ((xxx) != SYSCFG_CPU_LOCKUP) && \
                                            ((xxx) != SYSCFG_BKPRAM_LOCKUP) && ((xxx) != SYSCFG_SRAM1_LOCKUP) && \
                                            ((xxx) != SYSCFG_SRAM0_LOCKUP)  && ((xxx) != SYSCFG_DTCM_LOCKUP) && \
                                            ((xxx) != SYSCFG_ITCM_LOCKUP)   && ((xxx) != SYSCFG_AXIRAM_LOCKUP))

#define NOT_SYSCFG_TIMERCI_INPUT(xxx)       (((xxx) != TIMER7_CI0_INPUT_TIMER7_CH0)        && ((xxx) != TIMER7_CI0_INPUT_CMP1_OUT) && \
                                            ((xxx) != TIMER7_CI1_INPUT_TIMER7_CH1)        && ((xxx) != TIMER7_CI2_INPUT_TIMER7_CH2) && \
                                            ((xxx) != TIMER7_CI3_INPUT_TIMER7_CH3)        && ((xxx) != TIMER0_CI0_INPUT_TIMER0_CH0) && \
                                            ((xxx) != TIMER0_CI0_INPUT_CMP0_OUT)          && ((xxx) != TIMER0_CI1_INPUT_TIMER0_CH1) && \
                                            ((xxx) != TIMER0_CI2_INPUT_TIMER0_CH2)        && ((xxx) != TIMER0_CI3_INPUT_TIMER0_CH3) && \
                                            ((xxx) != TIMER2_CI0_INPUT_TIMER2_CH0)        && ((xxx) != TIMER2_CI0_INPUT_CMP0_OUT) && \
                                            ((xxx) != TIMER2_CI0_INPUT_CMP1_OUT)          && ((xxx) != TIMER2_CI0_INPUT_CMP0_OR_CMP1_OUT) && \
                                            ((xxx) != TIMER2_CI1_INPUT_TIMER2_CH1)        && ((xxx) != TIMER2_CI2_INPUT_TIMER2_CH2) && \
                                            ((xxx) != TIMER2_CI3_INPUT_TIMER2_CH3)        && ((xxx) != TIMER1_CI0_INPUT_TIMER1_CH0) && \
                                            ((xxx) != TIMER1_CI1_INPUT_TIMER1_CH1)        && ((xxx) != TIMER1_CI2_INPUT_TIMER1_CH2) && \
                                            ((xxx) != TIMER1_CI3_INPUT_TIMER1_CH3)        && ((xxx) != TIMER1_CI3_INPUT_CMP0_OUT) && \
                                            ((xxx) != TIMER1_CI3_INPUT_CMP1_OUT)          && ((xxx) != TIMER1_CI3_INPUT_CMP0_OR_CMP1_OUT) && \
                                            ((xxx) != TIMER4_CI0_INPUT_TIMER4_CH0)        && ((xxx) != TIMER4_CI1_INPUT_TIMER4_CH1) && \
                                            ((xxx) != TIMER4_CI2_INPUT_TIMER4_CH2)        && ((xxx) != TIMER4_CI3_INPUT_TIMER4_CH3) && \
                                            ((xxx) != TIMER3_CI0_INPUT_TIMER3_CH0)        && ((xxx) != TIMER3_CI1_INPUT_TIMER3_CH1) && \
                                            ((xxx) != TIMER3_CI2_INPUT_TIMER3_CH2)        && ((xxx) != TIMER3_CI3_INPUT_TIMER3_CH3) && \
                                            ((xxx) != TIMER23_CI0_INPUT_TIMER23_CH0)      && ((xxx) != TIMER23_CI1_INPUT_TIMER23_CH1) && \
                                            ((xxx) != TIMER23_CI2_INPUT_TIMER23_CH2)      && ((xxx) != TIMER23_CI3_INPUT_TIMER23_CH3) && \
                                            ((xxx) != TIMER22_CI0_INPUT_TIMER22_CH0)      && ((xxx) != TIMER22_CI1_INPUT_TIMER22_CH1) && \
                                            ((xxx) != TIMER22_CI2_INPUT_TIMER22_CH2)      && ((xxx) != TIMER22_CI3_INPUT_TIMER22_CH3) && \
                                            ((xxx) != TIMER22_CI3_INPUT_CMP0_OUT)         && ((xxx) != TIMER22_CI3_INPUT_CMP1_OUT) && \
                                            ((xxx) != TIMER22_CI3_INPUT_CMP0_OR_CMP1_OUT) && ((xxx) != TIMER14_CI0_INPUT_TIMER14_CH0) && \
                                            ((xxx) != TIMER14_CI0_INPUT_TIMER1_CH0)       && ((xxx) != TIMER14_CI0_INPUT_TIMER2_CH0) && \
                                            ((xxx) != TIMER14_CI0_INPUT_TIMER3_CH0)       && ((xxx) != TIMER14_CI0_INPUT_LXTAL) && \
                                            ((xxx) != TIMER14_CI0_INPUT_LPIRC4M)          && ((xxx) != TIMER14_CI0_INPUT_CKOUT1) && \
                                            ((xxx) != TIMER14_CI1_INPUT_TIMER14_CH1)      && ((xxx) != TIMER14_CI1_INPUT_TIMER1_CH1) && \
                                            ((xxx) != TIMER14_CI1_INPUT_TIMER2_CH1)       && ((xxx) != TIMER14_CI1_INPUT_TIMER3_CH1) && \
                                            ((xxx) != TIMER40_CI0_INPUT_TIMER40_CH0)      && ((xxx) != TIMER40_CI0_INPUT_TIMER2_CH0) && \
                                            ((xxx) != TIMER40_CI0_INPUT_TIMER3_CH0)       && ((xxx) != TIMER40_CI0_INPUT_TIMER4_CH0) && \
                                            ((xxx) != TIMER40_CI0_INPUT_LXTAL)            && ((xxx) != TIMER40_CI0_INPUT_LPIRC4M) && \
                                            ((xxx) != TIMER40_CI0_INPUT_CKOUT1)           && ((xxx) != TIMER40_CI1_INPUT_TIMER40_CH1) && \
                                            ((xxx) != TIMER40_CI1_INPUT_TIMER2_CH1)       && ((xxx) != TIMER40_CI1_INPUT_TIMER3_CH1) && \
                                            ((xxx) != TIMER40_CI1_INPUT_TIMER4_CH1)       && ((xxx) != TIMER41_CI0_INPUT_TIMER41_CH0) && \
                                            ((xxx) != TIMER41_CI0_INPUT_TIMER3_CH0)       && ((xxx) != TIMER41_CI0_INPUT_TIMER4_CH0) && \
                                            ((xxx) != TIMER41_CI0_INPUT_TIMER22_CH0)      && ((xxx) != TIMER41_CI0_INPUT_LXTAL) && \
                                            ((xxx) != TIMER41_CI0_INPUT_LPIRC4M)          && ((xxx) != TIMER41_CI0_INPUT_CKOUT1) && \
                                            ((xxx) != TIMER41_CI1_INPUT_TIMER41_CH1)      && ((xxx) != TIMER41_CI1_INPUT_TIMER3_CH1) && \
                                            ((xxx) != TIMER41_CI1_INPUT_TIMER4_CH1)       && ((xxx) != TIMER41_CI1_INPUT_TIMER22_CH1) && \
                                            ((xxx) != TIMER42_CI0_INPUT_TIMER42_CH0)      && ((xxx) != TIMER42_CI0_INPUT_TIMER4_CH0) && \
                                            ((xxx) != TIMER42_CI0_INPUT_TIMER22_CH0)      && ((xxx) != TIMER42_CI0_INPUT_TIMER23_CH0) && \
                                            ((xxx) != TIMER42_CI0_INPUT_LXTAL)            && ((xxx) != TIMER42_CI0_INPUT_LPIRC4M) && \
                                            ((xxx) != TIMER42_CI0_INPUT_CKOUT1)           && ((xxx) != TIMER42_CI1_INPUT_TIMER42_CH1) && \
                                            ((xxx) != TIMER42_CI1_INPUT_TIMER4_CH1)       && ((xxx) != TIMER42_CI1_INPUT_TIMER22_CH1) && \
                                            ((xxx) != TIMER42_CI1_INPUT_TIMER23_CH1)      && ((xxx) != TIMER15_CI0_INPUT_TIMER15_CH0) && \
                                            ((xxx) != TIMER15_CI0_INPUT_IRC32K)           && ((xxx) != TIMER15_CI0_INPUT_LXTAL) && \
                                            ((xxx) != TIMER15_CI0_INPUT_WKUP_IT)          && ((xxx) != TIMER16_CI0_INPUT_TIMER16_CH0) && \
                                            ((xxx) != TIMER16_CI0_INPUT_RSPDIF)           && ((xxx) != TIMER16_CI0_INPUT_HXTAL_RTCDIV) && \
                                            ((xxx) != TIMER16_CI0_INPUT_CKOUT0)           && ((xxx) != TIMER43_CI0_INPUT_TIMER43_CH0) && \
                                            ((xxx) != TIMER43_CI0_INPUT_TIMER22_CH0)      && ((xxx) != TIMER43_CI0_INPUT_TIMER23_CH0) && \
                                            ((xxx) != TIMER43_CI0_INPUT_LXTAL) && \
                                            ((xxx) != TIMER43_CI0_INPUT_LPIRC4M)          && ((xxx) != TIMER43_CI0_INPUT_CKOUT1) && \
                                            ((xxx) != TIMER43_CI1_INPUT_TIMER43_CH1)      && ((xxx) != TIMER43_CI1_INPUT_TIMER22_CH1) && \
                                            ((xxx) != TIMER43_CI1_INPUT_TIMER23_CH1)      && \
                                            ((xxx) != TIMER44_CI0_INPUT_TIMER44_CH0)      && ((xxx) != TIMER44_CI0_INPUT_TIMER23_CH0) && \
                                            ((xxx) != TIMER44_CI0_INPUT_LXTAL)            && ((xxx) != TIMER44_CI0_INPUT_LPIRC4M) && \
                                            ((xxx) != TIMER44_CI0_INPUT_CKOUT1)           && ((xxx) != TIMER44_CI1_INPUT_TIMER44_CH1) && \
                                            ((xxx) != TIMER44_CI1_INPUT_TIMER23_CH1))

#define NOT_SYSCFG_IO_COMPENSATION(xxx)     (((xxx) != SYSCFG_IO_COMPENSATION_ENABLE)  && ((xxx) != SYSCFG_IO_COMPENSATION_DISABLE))

#define NOT_SYSCFG_MOS_COMPENSATION(xxx)    (((xxx) != NMOS_COMPENSATION) && ((xxx) != PMOS_COMPENSATION))

#define NOT_SYSCFG_SECURE_SRAM_SIZE(xxx)    (((xxx) != SECURE_SRAM_SIZE_0KB)   && ((xxx) != SECURE_SRAM_SIZE_32KB) && \
                                            ((xxx) != SECURE_SRAM_SIZE_64KB)  && ((xxx) != SECURE_SRAM_SIZE_128KB))

#define NOT_SYSCFG_FPUINT(xxx)              (((xxx) != SYSCFG_FPUINT_INEXACT)           && ((xxx) != SYSCFG_FPUINT_INPUT_ABNORMAL) && \
                                            ((xxx) != SYSCFG_FPUINT_OVERFLOW)          && ((xxx) != SYSCFG_FPUINT_UNDERFLOW) && \
                                            ((xxx) != SYSCFG_FPUINT_DIV0)              && ((xxx) != SYSCFG_FPUINT_INVALID_OPERATION))

#define NOT_SYSCFG_FLAG(xxx)                (((xxx) != SYSCFG_FLAG_IO_LOW_VOLTAGE)     && ((xxx) != SYSCFG_FLAG_COMPENSATION_READY))

#define NOT_SYSCFG_CACHE_STATUS(xxx)        (((xxx) != ICACHE_STATUS) && ((xxx) != DCACHE_STATUS))

